import 'package:nyue/data/chapter.dart';
import 'package:nyue/network/api_list.dart';

ChapterContent chapterCotnent = ChapterContent.fromJson("""
{
    "id": 115088,
    "name": "道君",
    "cid": 5946751,
    "cname": "第一千一百章 江湖人称盗爷",
    "pid": 5946749,
    "nid": 5946784,
    "content": "    牛有道顺这条路挨着一家家问过来，凭栏处的敖丰一看就知道牛有道的目的。\r\n　　\r\n　　    轮到这里，敖丰被叫下去后，与牛有道碰面在了路中央。\r\n　　\r\n　　    待到秦、柯和盯梢的二人退开后，敖丰看到了前面问话的情况，知道牛有道已经创造了良好的谈话环境，大可放心交流，低声道：“你还真跑来了。牛有道，我算是服了你，见过胆大的，没见过你这么大胆的，就这样跑来无量园，你还真够可以的，我估计九圣弟子知道了都要对你佩服的五体投地。”\r\n　　\r\n　　    牛有道：“没办法，之前和先生见面的时间太过短暂，许多事情还没有搞清楚，我必须想办法再和先生碰上一面才行。”\r\n　　\r\n　　    敖丰：“我就奇怪了，干这种事，你难道就一点都不害怕？”\r\n　　\r\n　　    牛有道：“害怕于事无补。凡事都是习惯了就好，习惯了，就是件事而已，谨慎去做便可，谈不上什么害怕。”\r\n　　\r\n　　    敖丰：“看来胆大包天的事情你干过不少。”\r\n　　\r\n　　    牛有道：“你这是夸我呢，还是贬我？先生，我进来一趟不容易，还是抓紧时间谈正事吧。”\r\n　　\r\n　　    敖丰：“这事我想了又想，就算能对付鸦将又如何，根本不可能成功，就此打住吧，没有成功的任何可能。”\r\n　　\r\n　　    牛有道：“定下了目标，只需朝目标走，遇上了问题解决问题，一个问题一个问题去解决便可，还没有去做，怎么就知道没有任何成功的可能。”\r\n　　\r\n　　    敖丰：“不说其他的，目标处九座环绕的监视楼你看到了，每栋楼里都有九家的各自三人全天候监视，九家时时刻刻都有人盯着，图谋不轨的人根本没办法接近，一靠近就会被发现。不管你是偷也好，还是抢也好，就算得到了果子，这防御大阵根本无法硬冲出去。冲出去了也将面临不可能摆脱的追杀，牛有道，放弃吧，真有那么容易得手，圣境内比我们有能耐的人多的是，轮不到你我来打主意。”\r\n　　\r\n　　    牛有道：“你放心，只要解决了鸦将的问题，人的问题根本不算问题，我早有打算。”\r\n　　\r\n　　    敖丰：“你说的轻松，怎么打算？”\r\n　　\r\n　　    牛有道：“我会帮你把人调离，会给你创造动手的机会。”\r\n　　\r\n　　    敖丰惊疑不定，“给我创造动手的机会？你什么意思？让我去偷？”\r\n　　\r\n　　    牛有道：“你是无量园内部的人，监守自盗才是最佳的办法，你不去偷，谁去偷？”\r\n　　\r\n　　    敖丰：“你开什么玩笑？我胆小，你别吓我！”\r\n　　\r\n　　    牛有道：“你放心，不是你一个人在战斗，我会亲自来配合你的。等我再次进无量园的时候就是你动手的时候！”\r\n　　\r\n　　    敖丰：“你还要再进来？不对，你既然还要再进来，你自己动手不就行了，干嘛还非要我动手。”\r\n　　\r\n　　    牛有道反问一句：“你能把果树附近的守卫全部调离吗？”\r\n　　\r\n　　    “……”敖丰哑了哑，最终道：“不能！他们不可能会听我的，也不可能会听你的。”\r\n　　\r\n　　    牛有道：“那可不一定，我自有我的办法。我有办法自然是我来负责调离，你来负责下手，这事不可能让太多人知道，动手的时候只有你我两人配合行事。唉，你这表情…先生，牛某不会让人做不可能做到的为难事情，我一定会为朋友考虑妥当。我再次进来的时候，一定会给你一个能让你放心大胆去下手的环境，你有了把握再去做，没把握可以不做，你觉得如何？”\r\n　　\r\n　　    敖丰：“我怎么感觉你在说梦话似的？”\r\n　　\r\n　　    牛有道：“是不是梦话，事实说明一切。好了，鸦将的事，还有附近守卫的事，已经有了解决之道，剩下的问题是怎么把东西给弄出去，这也是我这次来的主要原因之一。”\r\n　　\r\n　　    敖丰：“你先别担心怎么把东西给弄出去，我问你，下手后我怎么离开？我守在这里等死不成？大阵防护下，天上地下都被锁住了，稍有触及立刻会被发现，我怎么办？”\r\n　　\r\n　　    牛有道：“我说了，有问题解决问题，咱们一个一个来解决。我问你，你有没有机会离开无量园？总不能是进了无量园的人永远都不能出去吧？”\r\n　　\r\n　　    敖丰：“这倒不至于，但基本上也没什么出去的机会，无量园的人，每人每年会给一个月的假期，允许出去活动一个月。当然，你若不愿出去也可以呆在这不出去。对许多人来说，宁愿不出去，出去一趟回来后面临的严密审查会很麻烦，稍有出漏，宁可杀错不会放过！不出去的话，假期不会累积，会自动视做放弃。”\r\n　　\r\n　　    牛有道：“每个人出去的时间是固定的吗？”\r\n　　\r\n　　    敖丰：“不是，稍微有点需求上的自由，允许请假，一年只有一次。”\r\n　　\r\n　　    牛有道：“这不就结了，你到时候请假离开不就行了。”\r\n　　\r\n　　    敖丰差点瞪大了双眼，尽量克制自己的情绪道：“你疯了吧？进出的人都要接受检查，我怎么可能把东西给带出去？”\r\n　　\r\n　　    牛有道：“这就是接下来要解决的问题，怎么把东西弄出去。我刚才进来的时候，发现门口守卫也谈不上多严密，还是有机会的，只要能过守卫那一关，东西就能出去，你有没有机会把自己弄门口去值守？若没有，你可以把值守情况说说，我帮忙出主意想办法。”\r\n　　\r\n　　    敖丰差点苦笑，“这个还真不需要想办法，我现在就是看大门的。”\r\n　　\r\n　　    牛有道：“你？堂堂督圣尊的徒孙看大门？”\r\n　　\r\n　　    敖丰：“你还有脸问这个？你自己心里没点数？这还不是拜你所赐？荒泽死地回来后，你觉得我还能舒服不成？如今就是个打杂的，轮到无虚圣地这边守门时就由我去守门。你别想多了，就是看门报信，报知有人来了什么的，阵法开闭不归我管，人进人出的检查有其他人。”\r\n　　\r\n　　    牛有道：“我只想知道阵法大门开闭时你是不是在门口？”\r\n　　\r\n　　    敖丰：“是在门口，但根本不可能出去，何况看门的不止我一个。”\r\n　　\r\n　　    牛有道：“几个人看门？”\r\n　　\r\n　　    敖丰：“两个。”\r\n　　\r\n　　    牛有道：“你多久轮值一次？”\r\n　　\r\n　　    敖丰：“这里有几家就几天轮一次，九家，每九天轮一次。”\r\n　　\r\n　　    “九天？”牛有道嘀咕了一声，复又问：“阵法出入口开启有规律吗？”\r\n　　\r\n　　    敖丰：“这哪有什么规律，圣地随时可能来人检查，人到人出没有任何规律可言，事凑到一起的时候一天可能开启几次，有时十天半个月都未必会开启一次。”\r\n　　\r\n　　    牛有道：“出了眼前这样的事，是个机会，开启的频率应该会频繁些。若实在是逮不住机会，那只有慢慢等机会。”\r\n　　\r\n　　    敖丰：“等什么机会？”\r\n　　\r\n　　    牛有道：“你先做件事情，我会让狐族派人想办法摸到门口，待到阵门开启时，你要做的是和狐族互相传递一次消息。”\r\n　　\r\n　　    敖丰吃惊，“这怎么可能做到？”\r\n　　\r\n　　    牛有道：“大门的位置我已经记下了，狐族的信会想办法送到门口，会做出让你辨识的记号，你留心观察应该能发现。至于你怎么取得消息，又怎么将消息传递出去，这个你自己视情况而定想办法。现在说太多其他的没用，下一步的行动计划，我会让狐族传递给你。”\r\n　　\r\n　　    “想得手，你就必须想办法完成这个过程，你只有经历了这个过程，接下来的事情你才会有把握。只要按我说的去做，你自然会明白。”\r\n　　\r\n　　    敖丰：“你跟我讲的这些，我怎么感觉都挺虚无缥缈的。”\r\n　　\r\n　　    牛有道：“感觉不重要，重要的是能不能做到。现在我不宜跟你交谈太久，你只需知道，我不但会把东西给弄出去，还会让你安全脱身，而且无量园还不会发现东西丢了。”\r\n　　\r\n　　    敖丰：“说的比唱的还好听，这不可能！”\r\n　　\r\n　　    牛有道：“当年江湖人送牛某外号‘盗爷’，是不是浪得虚名得做过了才知道。好了，说的有点久了。记住我交代的事，我会一步步引导你去做，不用怕。别人问起，就说我问的都是事发时的情况，我问其他人的也是这些，告辞！”\r\n　　\r\n　　    说罢不管敖丰的反应，径直转身而去，又再次找下家了。\r\n　　\r\n　　    连找几家后，正在与另一人在路上交谈之际，丁卫一行来了。\r\n　　\r\n　　    走到牛有道跟前后，丁卫淡淡问道：“你是准备留下来继续盘查，还是跟我一起离开？”\r\n　　\r\n　　    牛有道：“先生现在就走吗？”\r\n　　\r\n　　    丁卫不置可否：“你有你的职责，你若想留下我不勉强。”说罢就走。\r\n　　\r\n　　    牛有道立刻对谈话者说就此打住，然后匆匆招呼上秦、柯二人走了。\r\n　　\r\n　　    他来就是为了和敖丰碰面的，又不是真来查案的，何况他知道发生的事和无量园内的人没有任何关系，哪会继续在这里浪费时间。非必要，不会久留。\r\n　　\r\n　　    离去的途中，白发老头突然问了句，“牛有道，可有发现什么问题？”\r\n　　\r\n　　    素未谋面，能喊出名字来，可见已经通过丁卫的口中知道了些什么。\r\n　　\r\n　　    牛有道一本正经道：“前辈最好还是不要过问的好，有什么问题我会直接呈报给圣尊！”\r\n　　\r\n　　    白发老头脸颊抽搐了一下，欲言又止之后最终还是闭嘴了。\r\n　　\r\n　　    丁卫下意识回头瞅了牛有道一眼，心中暗暗琢磨，难道真的被这厮发现了无量园内部有什么问题不成？若真是如此的话的，恐怕要掀起一场狂风暴雨。\r\n　　\r\n　　    他也想问问有没有发现什么问题，奈何牛有道已经那样说了，他也不敢再多问什么。\r\n　　\r\n　　\f\t\n",
    "hasContent": 1
  }
""");

class ChapterReaderState {
  Future<ChapterContent> request(int bookId, int chapterId) {
    return HttpUtil.getChapterContent(bookId, chapterId).then((value) {
      return value;
    });
  }
}

class ChapterReaderStateInitial extends ChapterReaderState {
  int bookId;
  int chapterId;
  ChapterReaderStateInitial(int bookId, int chapterId);
}

class ChapterReaderContentState extends ChapterReaderState {
  ChapterContent content;
}

class ChapterReaderSettingState {
  ChapterReaderSettingState();
}
